In [1]:
import numpy as np
import pandas as pd

In [2]:
s = pd.Series([1, 3, 5, np.nan, 6,8])

In [3]:
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [16]:
dates = pd.date_range(2013010, periods=6)

In [17]:
dates

DatetimeIndex(['1970-01-01 00:00:00.002013010',
               '1970-01-02 00:00:00.002013010',
               '1970-01-03 00:00:00.002013010',
               '1970-01-04 00:00:00.002013010',
               '1970-01-05 00:00:00.002013010',
               '1970-01-06 00:00:00.002013010'],
              dtype='datetime64[ns]', freq='D')

In [22]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list('ABCD'))

In [23]:
df

                                      A         B         C         D
1970-01-01 00:00:00.002013010 -1.982482 -2.978034 -0.411647 -0.094877
1970-01-02 00:00:00.002013010  0.467085  0.784783  0.338259  0.585738
1970-01-03 00:00:00.002013010  0.060257  0.299370  0.538157 -0.815002
1970-01-04 00:00:00.002013010 -0.178031 -0.842260 -1.875565 -0.071722
1970-01-05 00:00:00.002013010 -1.220202  0.074153 -0.760660  1.972341
1970-01-06 00:00:00.002013010 -1.032685 -0.161429  2.487085  0.069793

In [30]:
df2 = pd.DataFrame(
{
    'A': 1.0,
    "B": pd.Timestamp("20130102"),
    'C': pd.Series(1, index=list(range(4)), dtype='float32'),
    'D': np.array([3] * 4, dtype='int32'),
    'E': pd.Categorical(['teste', 'train', 'test', 'train']),
    'F': 'Foo'
})

In [31]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3  teste  Foo
1  1.0 2013-01-02  1.0  3  train  Foo
2  1.0 2013-01-02  1.0  3   test  Foo
3  1.0 2013-01-02  1.0  3  train  Foo

In [32]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [35]:
df2.head()

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3  teste  Foo
1  1.0 2013-01-02  1.0  3  train  Foo
2  1.0 2013-01-02  1.0  3   test  Foo
3  1.0 2013-01-02  1.0  3  train  Foo

In [36]:
df2.tail(3)

     A          B    C  D      E    F
1  1.0 2013-01-02  1.0  3  train  Foo
2  1.0 2013-01-02  1.0  3   test  Foo
3  1.0 2013-01-02  1.0  3  train  Foo

In [37]:
df2.index

Int64Index([0, 1, 2, 3], dtype='int64')

In [38]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [39]:
df2.to_numpy()

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'teste', 'Foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'Foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'Foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'Foo']],
      dtype=object)

In [40]:
df.to_numpy()

array([[-1.98248233, -2.97803365, -0.41164674, -0.09487729],
       [ 0.46708457,  0.78478301,  0.33825904,  0.58573753],
       [ 0.0602567 ,  0.29936998,  0.53815661, -0.81500172],
       [-0.17803093, -0.84226023, -1.87556534, -0.07172231],
       [-1.22020155,  0.07415253, -0.76065961,  1.97234139],
       [-1.0326848 , -0.16142944,  2.48708489,  0.06979263]])

In [41]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.647676 -0.470570  0.052605  0.274378
std    0.918929  1.340637  1.472333  0.944962
min   -1.982482 -2.978034 -1.875565 -0.815002
25%   -1.173322 -0.672053 -0.673406 -0.089089
50%   -0.605358 -0.043638 -0.036694 -0.000965
75%    0.000685  0.243066  0.488182  0.456751
max    0.467085  0.784783  2.487085  1.972341

In [42]:
df.T

,1970-01-01 00:00:00.002013010,1970-01-02 00:00:00.002013010,1970-01-03 00:00:00.002013010,1970-01-04 00:00:00.002013010,1970-01-05 00:00:00.002013010,1970-01-06 00:00:00.002013010
A,-1.982482,0.467085,0.060257,-0.178031,-1.220202,-1.032685
B,-2.978034,0.784783,0.299370,-0.842260,0.074153,-0.161429
C,-0.411647,0.338259,0.538157,-1.875565,-0.760660,2.487085
D,-0.094877,0.585738,-0.815002,-0.071722,1.972341,0.069793

In [43]:
df.sort_index(axis=1, ascending=False)

                                      D         C         B         A
1970-01-01 00:00:00.002013010 -0.094877 -0.411647 -2.978034 -1.982482
1970-01-02 00:00:00.002013010  0.585738  0.338259  0.784783  0.467085
1970-01-03 00:00:00.002013010 -0.815002  0.538157  0.299370  0.060257
1970-01-04 00:00:00.002013010 -0.071722 -1.875565 -0.842260 -0.178031
1970-01-05 00:00:00.002013010  1.972341 -0.760660  0.074153 -1.220202
1970-01-06 00:00:00.002013010  0.069793  2.487085 -0.161429 -1.032685

In [44]:
df.sort_values(by='B')

                                      A         B         C         D
1970-01-01 00:00:00.002013010 -1.982482 -2.978034 -0.411647 -0.094877
1970-01-04 00:00:00.002013010 -0.178031 -0.842260 -1.875565 -0.071722
1970-01-06 00:00:00.002013010 -1.032685 -0.161429  2.487085  0.069793
1970-01-05 00:00:00.002013010 -1.220202  0.074153 -0.760660  1.972341
1970-01-03 00:00:00.002013010  0.060257  0.299370  0.538157 -0.815002
1970-01-02 00:00:00.002013010  0.467085  0.784783  0.338259  0.585738

In [45]:
df['A']

1970-01-01 00:00:00.002013010   -1.982482
1970-01-02 00:00:00.002013010    0.467085
1970-01-03 00:00:00.002013010    0.060257
1970-01-04 00:00:00.002013010   -0.178031
1970-01-05 00:00:00.002013010   -1.220202
1970-01-06 00:00:00.002013010   -1.032685
Freq: D, Name: A, dtype: float64